Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLC_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLP_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_INNER_VLAN_INCL_CSVL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_INNER_VLAN_INCL_CSVL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_INNER_VLAN_INCL_CSVL_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLTI_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLTI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLTI_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.FCB_BPA */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.FCB_BPA */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.FCB_BPA */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_OFF (7u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ2EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ2EN_LEN (2u)

